{"pageProps":{"basics":{"name":"Jerry Batorski","email":"jerry.batorski@gmail.com","url":"https://jarekb84.github.io/my","summary":"Frontend software engineer, with over 11 years of experience, covering everything from implementing ideas to leading projects."},"skills":["JavaScript","React","Redux","SCSS","Jasmine/Karma","TestCafe","Jest","RTL","TypeScript","SCRUM","JIRA","Git"],"jobs":[{"companyName":"Grubhub","startDate":"2016-11-01","endDate":null,"positions":[{"title":"Staff Engineer","startDate":"2021-08-01","endDate":null},{"title":"Senior Software Engineer","startDate":"2018-03-01","endDate":"2021-08-01"},{"title":"Software Engineer II","startDate":"2016-11-01","endDate":"2018-03-01"}],"highlights":["Built functional React components (utilizing hooks when appropriate), elevated common state and async handling to redux reducers, and extracted components as sensible patterns of usage emerged.","Utilize Grubhub’s component library for common cases to solve design needs, maintain consistency of user experience, and speed up development. For situational needs, have leveraged SCSS or Styled Components.","Wrote unit, integration, and E2E tests, balancing coverage, confidence, level of effort, and maintenance costs.","Championed good programming practices by writing clear/maintainable code, thorough code reviews, balancing development speed vs tech debt, and participating in architecture discussions.","Adept at ramping up on unfamiliar codebases and domains, making meaningful contributions, after tackling projects across the Restaurant, Delivery, Customer Support, Corporate Client, and Diner portions of the Grubhub business.","Worked with product, design, and engineering across the organization to understand the impact of project changes, clarify intent, identify gaps, and propose solutions.","Broke projects down into deliverable features and parallelizable stories, prioritizing work based on the most business value.","In recent years, split my time between leading a squad of 3 front end engineers and implementation work. Lead agile ceremonies and was responsible for deliverables of multiple concurrent projects.","Heavily engaged in team book club, tackling topics around code quality, professionalism, communication, remote work, and project management. Topics like Phoenix Project, Clean Code, and GitLab’s Remote Work Playbook were especially influential in how my squad, team, and I operated."]},{"companyName":"CDK Global","startDate":"2014-10-01","endDate":"2016-08-01","positions":[{"title":"Software Developer","startDate":"2014-10-01","endDate":"2016-08-01"}],"highlights":["As part of a multi team environment, developed the Inventory product within the suite of applications that make up CDK's Front Office Edge application in the automotive dealership industry. App built using Angular JS and tested with Jasmine/Selenium. Utilizing Grunt, RequireJS, ESLint, and Karma in the build process.","Helped team come up with a testing strategy encompassing unit, integration, and end to end tests to improve confidence when deploying changes from development to production environments.","Primary resource for configuring and troubleshooting the Continuous Integration pipeline using Git, Bamboo, Grunt, Jasmine/Karma, ESLint, Sonar, SauceLabs, Nolio, Ansible, and Puppet. This included automated gating for code quality, code reviews, and unit/integration/e2e tests.","Helped team and company practice agile as a Scrum Master, mentored junior Product Owner regarding Agile practices, started Scrum discussions with other SM’s to share ideas, problems, and solutions.","Mentored developers in the practice of unit testing, writing maintainable code, design, and troubleshooting.","Advocate of documenting on-boarding procedures, research initiatives, and team strategies."]},{"companyName":"Answers Media","startDate":"2012-03-01","endDate":"2014-10-01","positions":[{"title":"Software Developer","startDate":"2012-03-01","endDate":"2014-10-01"}],"highlights":["Developed live Q&A session web app utilizing SignalR across load balanced servers with a SQL Server Backplane to facilitate communication between thousands of connected clients. Angular.js was used to create the UI, allow admins to toggle availability of sections in the UI, and push changes via SignalR to all clients.","Utilizing MVC4 razor views, jQuery, and AJAX, developed dynamic admin interface with a simple workflow targeted at business users, allowing them to easily create and manage our Learning Management System component with little training.","Extended in-house CMS built upon C# .NET 4.5, Entity Framework CodeFirst, SQL Server 2012, MVC 4 using Razor engine, and heavy use of jQuery and Ajax.","Developed IDE like editor to create XHTML templates, infused with our custom modules that could be added and configured without page refreshes."]},{"companyName":"Chicago Public Schools","startDate":"2007-10-01","endDate":"2012-03-01","positions":[{"title":"Human Capital IT Systems Analyst","startDate":"2010-08-01","endDate":"2012-03-01"},{"title":"Senior Payroll Analyst","startDate":"2008-07-01","endDate":"2010-08-01"},{"title":"Payroll Systems Analyst","startDate":"2007-10-01","endDate":"2008-07-01"}],"highlights":["As part of a small team, developed an ASP.NET Online Recruiting System for school based personnel used to collect candidate data, automatically post vacant positions, and to hire candidates. Tight three-month schedule resulted in 30,000 applications and 3,200 hires within six months of launching.","On variety of smaller projects: meet with stakeholders to understand business needs, worked with end users to understand workflows, and developed the ASP.NET apps to address those needs.","Initiated various internal system upgrades including: use of TFS as a source control system, developed a branching strategy to accommodate multiple development streams, upgraded all systems to .NET 4, introduced logging using Log4Net, and created a deployment and hosting strategy to accommodate the testing of multiple development streams.","Ran payroll for 55k+ employees, wrote SQL audit reports, built tooling to automate execution of reports."]}]},"__N_SSG":true}